[
    {
        "organization": "Love Notes",
        "slug": "love-notes",
        "description": "Every year during the week of Valentine's Day, we raise money for the Downtown Women's Center through our Love Notes fundraiser during which we offer live and virtual serenades. This year, we delivered over 100 Love Notes and raised almost $2,000! You can support our cause by ordering a Love Note for a loved one.",
        "images": 4,
        "links":
        [
            {
                "text": "Learn more about Love Notes",
                "url": "https://medleysacappella.org/love-notes"
            },
            {
                "text": "Learn more about the Downtown Women's Center",
                "url": "https://downtownwomenscenter.org/"
            }
        ]
    },
    {
        "organization": "UCLA Health × UCLA People-Animal Connection",
        "slug": "people-animal-connection",
        "description": "We have the honor of caroling for the amazing patients and dedicated staff at Ronald Reagan UCLA Medical Center and UCLA Santa Monica Medical Center alongside UCLA People-Animal Connection's talented dogs and wonderful team. We sing classic Christmas and Hanukkah carols for the December holidays and some of our Love Notes songs for Valentine's Day.",
        "images": 4,
        "links":
        [
            {
                "text": "Learn more about UCLA People-Animal Connection",
                "url": "https://www.uclahealth.org/programs/pac"
            },
            {
                "text": "Read about us on KNX News",
                "url": "https://www.audacy.com/knxnews/news/local/dogs-visit-kids-at-ucla-medical-center-for-valentines-day"
            }
        ]
    },
    {
        "organization": "Reading to Kids",
        "slug": "reading-to-kids",
        "description": "We enjoy reading to students at various elementary schools in Los Angeles with the passionate volunteers at Reading to Kids. For the March 2024 \"Music and Entertainment\"-themed reading club, we performed our setlist for the students at MacArthur Park Elementary School.",
        "images": 2,
        "links":
        [
            {
                "text": "Learn more about Reading to Kids",
                "url": "https://readingtokids.org/main/main.php"
            }
        ]
    },
    {
        "organization": "Downtown Women's Center",
        "slug": "dwc",
        "description": "We love singing for the incredible women at the Downtown Women's Center. In 2024, we had the privilege of caroling during the holiday season and celebrated the success of our annual Love Notes fundraiser by showcasing some of our love songs. In the past, we've visited and performed at the Downtown Women's Center for Mother's Day.",
        "images": 4,
        "links":
        [
            {
                "text": "Learn more about the Downtown Women's Center",
                "url": "https://downtownwomenscenter.org/"
            }
        ]
    },
    {
        "organization": "Habitat for Humanity × UCLA Bruin Belles Service Association",
        "slug": "habitat-for-humanity",
        "description": "We competed in UCLA Bruin Belles Service Association's first-ever charity dodgeball tournament—the 2024 BelleBall Tournament—and won! As the winners, we had the opportunity to donate $1,000 to a charity of our choice. We chose Habitat for Humanity as the charity to receive the donation.",
        "images": 3,
        "links":
        [
            {
                "text": "Learn more about Habitat for Humanity",
                "url": "https://www.habitat.org/"
            },
            {
                "text": "Learn more about UCLA Bruin Belles Service Association",
                "url": "https://www.bruinbelles.com/"
            }
        ]
    },
    {
        "organization": "Los Angeles Mission",
        "slug": "la-mission",
        "description": "Every winter, we host a clothing drive during our holiday concert and collect clothing donations for Los Angeles Mission.",
        "images": 3,
        "links":
        [
            {
                "text": "Learn more about Los Angeles Mission",
                "url": "https://losangelesmission.org/"
            }
        ]
    },
    {
        "organization": "Los Angeles Unified School District",
        "slug": "lausd",
        "description": "Every spring, we organize a school supplies drive during our final concert and donate school supplies to the Los Angeles Unified School District's Homeless Education Office.",
        "images": 3,
        "links":
        [
            {
                "text": "Learn more about the Homeless Education Office",
                "url": "https://www.lausd.org/heo"
            }
        ]
    },
    {
        "organization": "UCLA Santa Monica Medical Center",
        "slug": "ucla-smmc",
        "description": "In 2024, we visited the pediatric unit at the UCLA Santa Monica Medical Center and had the honor of singing for the patients there as part of the Chase Child Life Program. We sang a mix of pop songs to help ease the stress of a hospital stay.",
        "images": 0,
        "links":
        [
            {
                "text": "Learn more about the Chase Child Life Program",
                "url": "https://www.chasefoundation.org/chase_child_life_program"
            }
        ]
    },
    {
        "organization": "Pediatric AIDS Coalition",
        "slug": "pediatric-aids-coalition",
        "description": "We performed virtually for Dance Marathon at UCLA in 2020 to support the Pediatric AIDS Coalition's mission to fundraise for and raise awareness about the fight against AIDS in children.",
        "images": 2,
        "links":
        [
            {
                "text": "Learn more about the Pediatric AIDS Coalition",
                "url": "https://pediatricaidscoalition.org/"
            },
            {
                "text": "Watch Dance Marathon 2020",
                "url": "https://www.youtube.com/watch?v=6nSl4-zXSRo"
            }
        ]
    },
    {
        "organization": "Providence Saint John's Health Center",
        "slug": "saint-johns",
        "description": "In 2019, we were honored to sing for the incredibly strong patients and hardworking staff at Providence Saint John's Health Center in Santa Monica.",
        "images": 3,
        "links":
        [
            {
                "text": "Learn more about Saint John's Health Center Foundation",
                "url": "https://saintjohnsfoundation.org/"
            }
        ]
    }
]